# PANDAS

In [2]:
import pandas as pd

In [3]:
lst = ['Geeks', 'For', 'Geeks', 'is', 
            'portal', 'for', 'Geeks']

In [4]:
lst

['Geeks', 'For', 'Geeks', 'is', 'portal', 'for', 'Geeks']

In [5]:
df = pd.DataFrame(lst)

In [6]:
df.head(2)

       0
0  Geeks
1    For

In [7]:
df.set_index(0)

Empty DataFrame
Columns: []
Index: [Geeks, For, Geeks, is, portal, for, Geeks]

In [8]:
df[0]

0     Geeks
1       For
2     Geeks
3        is
4    portal
5       for
6     Geeks
Name: 0, dtype: object

In [9]:
dict = {'avi': [1990, 'son'], 'maya': [1992, 'daughter'], 'shobha': [1965, 'mother'], 'krish': [1956, 'father']}

In [10]:
dict

{'avi': [1990, 'son'],
 'maya': [1992, 'daughter'],
 'shobha': [1965, 'mother'],
 'krish': [1956, 'father']}

In [31]:
df = pd.DataFrame(dict, index=None)

In [33]:
df

    avi      maya  shobha   krish
0  1990      1992    1965    1956
1   son  daughter  mother  father

In [13]:
df.transpose()

           0         1
avi     1990       son
maya    1992  daughter
shobha  1965    mother
krish   1956    father

In [14]:
df.loc[1]

avi            son
maya      daughter
shobha      mother
krish       father
Name: 1, dtype: object

In [15]:
df.loc[[1]]

   avi      maya  shobha   krish
1  son  daughter  mother  father

In [16]:
df.index

RangeIndex(start=0, stop=2, step=1)

In [17]:
df.empty

False

In [18]:
df.pivot

<bound method DataFrame.pivot of     avi      maya  shobha   krish
0  1990      1992    1965    1956
1   son  daughter  mother  father>

In [19]:
df

    avi      maya  shobha   krish
0  1990      1992    1965    1956
1   son  daughter  mother  father

In [26]:
df.loc[[1]]

   avi      maya  shobha   krish
1  son  daughter  mother  father

In [29]:
df.iloc[[0]]

    avi  maya shobha krish
0  1990  1992   1965  1956